arm-education/DSP-Edkits-Labs/Lab03_FIRFilters/Projects/STM32746G-Discovery/Lab03_Magnitude_Frequency_Response/Src/stm32f7_sysid_average.c
/* Includes ------------------------------------------------------------------*/
#include "stm32f7_sysid_average.h"
#include "stm32f7_prbs.h"
#include "arm_const_structs.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define SOURCE_FILE_NAME "stm32f7_sysid_average.c"
#define AUDIO_FREQ                16000u
#define AUDIO_IN_BIT_RES          16u
#define AUDIO_IN_CHANNEL_NBR      2u      
#define BLOCK_SAMPLES_PER_CH      512u    
#define BLOCK_SAMPLES_TOTAL       (BLOCK_SAMPLES_PER_CH * AUDIO_IN_CHANNEL_NBR)
#define BUF_SAMPLES               (BLOCK_SAMPLES_TOTAL * 2u) 
#define N                         10u

/* Adaptive filter (LMS) settings */
#define NUM_TAPS                  256u
#define LMS_BLOCK_SIZE            1u         
#define LMS_BETA                  1.0e-2f    

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static __attribute__((aligned(32))) uint16_t InBuf[BUF_SAMPLES];
static __attribute__((aligned(32))) uint16_t OutBuf[BUF_SAMPLES];

static __IO uint8_t InHalfComplete  = 0;
static __IO uint8_t InFullComplete  = 0;
static __IO uint8_t OutHalfComplete = 0;
static __IO uint8_t OutFullComplete = 0;

static uint32_t bufptr;

static float32_t h[N];
static float32_t xL[N];
static float32_t xR[N];

static float32_t firCoeffs32[NUM_TAPS];                                   
static float32_t firStateF32[LMS_BLOCK_SIZE + NUM_TAPS - 1];               
static arm_lms_norm_instance_f32 S;
static float32_t adapt_in, adapt_out, adapt_err;

static float32_t cmplx_buf[2u * NUM_TAPS];
static float32_t outbuffer[NUM_TAPS];


/* Private function prototypes -----------------------------------------------*/
static void MPU_Config(void);
static void SystemClock_Config(void);
static void CPU_CACHE_Enable(void);
static void Error_Handler(void);
static void ProcessAverage(const uint16_t *in, uint16_t *out, uint32_t length);
void BSP_AUDIO_OUT_ClockConfig(SAI_HandleTypeDef *hsai, uint32_t AudioFreq, void *Params);

/* Private functions ---------------------------------------------------------*/
void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
  ProcessAverage(InBuf, OutBuf, BLOCK_SAMPLES_TOTAL);
}

void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
  ProcessAverage(InBuf + BLOCK_SAMPLES_TOTAL, OutBuf + BLOCK_SAMPLES_TOTAL, BLOCK_SAMPLES_TOTAL);
}

static inline int16_t sat16f(float32_t y){
  if (y >  32767.0f) return  32767;
  if (y < -32768.0f) return -32768;
  return (int16_t)y;
}

static void ProcessAverage(const uint16_t *in, uint16_t *out, uint32_t length)
{
  for (uint32_t i = 0; i < length; i += AUDIO_IN_CHANNEL_NBR)
  {
    int16_t sL_i16 = (int16_t)prbs(8000);
    float32_t sL = (float32_t)sL_i16;

    float32_t ynL = 0.0f;
    for (uint32_t k = N - 1; k > 0; k--) xL[k] = xL[k - 1];
    xL[0] = sL;
    for (uint32_t k = 0; k < N; k++) ynL += h[k] * xL[k];

    float32_t desired = (float32_t)((int16_t)in[i + 0]);

    adapt_in = sL;
    arm_lms_norm_f32(&S, &adapt_in, &desired, &adapt_out, &adapt_err, LMS_BLOCK_SIZE);

    out[i + 0] = (uint16_t)sat16f(ynL);
    out[i + 1] = out[i + 0];
  }
}

int main(void)
{
  MPU_Config();
  CPU_CACHE_Enable();
  HAL_Init();
  SystemClock_Config();

	
  stm32f7_LCD_init(AUDIO_FREQ, SOURCE_FILE_NAME, GRAPH);

  for (uint32_t k=0; k<N; k++)  h[k] = 1.0f / (float32_t)N;

  for (uint32_t k=0; k<NUM_TAPS; k++) firCoeffs32[k] = 0.0f;
  arm_lms_norm_init_f32(&S, NUM_TAPS, firCoeffs32, firStateF32, LMS_BETA, LMS_BLOCK_SIZE);

  if (BSP_AUDIO_IN_OUT_Init(INPUT_DEVICE_INPUT_LINE_1,
                            OUTPUT_DEVICE_HEADPHONE,
                            AUDIO_FREQ,
                            AUDIO_IN_BIT_RES,
                            AUDIO_IN_CHANNEL_NBR) != AUDIO_OK)
  {
    Error_Handler();
  }

  BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);

  if (BSP_AUDIO_OUT_Play(OutBuf, sizeof(OutBuf)) != AUDIO_OK) {
    Error_Handler();
  }

  if (BSP_AUDIO_IN_Record(InBuf, BUF_SAMPLES) != AUDIO_OK) {
    Error_Handler();
  }

  /* UI loop: plot LMS coeffs or their spectrum */
  while (1)
  {
    int button = checkButtonFlag();
    if (button == 1) {
      for (uint32_t i=0; i<NUM_TAPS; i++) {
        cmplx_buf[2u*i + 0u] = firCoeffs32[i];
        cmplx_buf[2u*i + 1u] = 0.0f;
      }
      arm_cfft_f32(&arm_cfft_sR_f32_len256, cmplx_buf, 0, 1);
      arm_cmplx_mag_f32(cmplx_buf, outbuffer, NUM_TAPS);
      plotLogFFT(outbuffer, NUM_TAPS, LIVE);
    } else {
      plotLMS(firCoeffs32, NUM_TAPS, LIVE);
    }
  }
}
/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 216000000
  *            HCLK(Hz)                       = 216000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 25
  *            PLL_N                          = 432
  *            PLL_P                          = 2
  *            PLL_Q                          = 9
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 7
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;  
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /* activate the OverDrive to reach the 216 Mhz Frequency */
  if(HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }
  
  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;  
  if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7) != HAL_OK)
  {
    Error_Handler();
  }
}

void BSP_AUDIO_OUT_ClockConfig(SAI_HandleTypeDef *hsai, uint32_t AudioFreq, void *Params)
{
    RCC_PeriphCLKInitTypeDef clk;
    HAL_RCCEx_GetPeriphCLKConfig(&clk);

    clk.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
    clk.Sai2ClockSelection    = RCC_SAI2CLKSOURCE_PLLI2S;

    if (AudioFreq == AUDIO_FREQUENCY_16K) {
        clk.PLLI2S.PLLI2SN = 344;  // VCO = 344 MHz
        clk.PLLI2S.PLLI2SQ = 7;    //  1st = 49.14 MHz
        clk.PLLI2SDivQ     = 12;   //  MCLK � 4.095 MHz
    } else {
        /* ST default for 11/22/44 kHz */
        clk.PLLI2S.PLLI2SN = 429;
        clk.PLLI2S.PLLI2SQ = 2;
        clk.PLLI2SDivQ     = 19;
    }

    HAL_RCCEx_PeriphCLKConfig(&clk);
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
static void Error_Handler(void)
{
  /* User may add here some code to deal with this error */
  while(1)
  {
		BSP_LED_Toggle(LED1);
  }
}

/**
  * @brief  CPU L1-Cache enable.
  * @param  None
  * @retval None
  */
static void CPU_CACHE_Enable(void)
{
  /* Enable I-Cache */
  SCB_EnableICache();

  /* Enable D-Cache */
  SCB_EnableDCache();
}


/**
  * @brief  Configure the MPU attributes
  * @param  None
  * @retval None
  */
static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Disable the MPU */
  HAL_MPU_Disable();

  /* Configure the MPU as Strongly ordered for not defined regions */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x20010000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_256KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Enable the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */ 

/**
  * @}
  */ 

